testCases/ductFlowAR1Reb3500/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kOmegaSSTPDA; 
    secondaryMode   2;          //0:off | 1:ModelI | 2:ModelII
    separationMode  3;          //0:off | 1:ModelI | 2:ModelII | 3:ModelIII | 4:ModelIV
}



// ************************************************************************* //
