testCases/ductFlowAR1Reb3500/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "5000";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
2304
(
0.00618216
0.00616401
0.00612998
0.00608203
0.00602186
0.00595096
0.00587063
0.005782
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    walls
    {
        lowReCorrection 1;
        blending        stepwise;
        n               2;
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
96
(
1.21652e-05
8.68385e-05
0.000196603
0.000331675
0.00048387
0.000646473
0.000814773
0.000985807
...
)
;
    }
    symPlanes
    {
        type            symmetry;
    }
}


// ************************************************************************* //
